In [1]:
# Importing sqltie
import sqlite3

In [2]:
# Creating the connection object.
conn = sqlite3.connect('example.db')

In [3]:
# Creating cursor object to execute the sqlite3 statements.
cursor = conn.cursor()

In [4]:
# Now we can use the cursor to call the execute() method to execute any SQL queries.
sql = '''CREATE TABLE EMPLOYEE(
    FIRST_NAME CHAR(20) NOT NULL,
    LAST_NAME CHAR(20),
    AGE INT NOT NULL,
    SEX CHAR(1), 
    INCOME FLOAT
)'''

In [5]:
# Create table using CREATE TABLE
cursor.execute(sql)

In [6]:
# Call commit to save changes to the database
conn.commit()

In [7]:
# selecting the schema of the employee table
data = cursor.execute('PRAGMA table_info(employee)')
print(data.fetchall())

[(0, 'FIRST_NAME', 'CHAR(20)', 1, None, 0), (1, 'LAST_NAME', 'CHAR(20)', 0, None, 0), (2, 'AGE', 'INT', 1, None, 0), (3, 'SEX', 'CHAR(1)', 0, None, 0), (4, 'INCOME', 'FLOAT', 0, None, 0)]

In [8]:
# Insert employees data sent in an array into the employee table
def insert_employee(employees):
    print(employees)
    sql = "INSERT INTO EMPLOYEE(FIRST_NAME, LAST_NAME, AGE, SEX, INCOME) VALUES "
    for employee in employees:
        print(employee)
        sql = sql + "('" + employee["first_name"] + "','" + employee["last_name"]  + "','" + employee["age"]  + "','" + employee["sex"] + "','" + employee["income"] + "'),"
        print(sql)
    sql = sql[:-1]
    print(sql)
    result = cursor.execute(sql)

In [9]:
# calling insert employee method to insert employee
data = insert_employee([{"first_name":"sunil", "last_name":"rai", "age": "26", "sex": "M", "income": "1000000"}, {"first_name":"sabnam", "last_name":"rai", "age": "25", "sex": "F", "income": "100000"}, {"first_name":"ujjawal", "last_name":"poudel", "age": "27", "sex": "M", "income": "1000000"}, {"first_name":"Sarita", "last_name":"gurung", "age": "24", "sex": "F", "income": "100000"}])

# gets all the affected rows and total affected rows.
affectedrows = cursor.execute('select changes(),total_changes()')
affectedrows.fetchall()

[{'first_name': 'sunil', 'last_name': 'rai', 'age': '26', 'sex': 'M', 'income': '1000000'}, {'first_name': 'sabnam', 'last_name': 'rai', 'age': '25', 'sex': 'F', 'income': '100000'}, {'first_name': 'ujjawal', 'last_name': 'poudel', 'age': '27', 'sex': 'M', 'income': '1000000'}, {'first_name': 'Sarita', 'last_name': 'gurung', 'age': '24', 'sex': 'F', 'income': '100000'}]
{'first_name': 'sunil', 'last_name': 'rai', 'age': '26', 'sex': 'M', 'income': '1000000'}
INSERT INTO EMPLOYEE(FIRST_NAME, LAST_NAME, AGE, SEX, INCOME) VALUES ('sunil','rai','26','M','1000000'),
{'first_name': 'sabnam', 'last_name': 'rai', 'age': '25', 'sex': 'F', 'income': '100000'}
INSERT INTO EMPLOYEE(FIRST_NAME, LAST_NAME, AGE, SEX, INCOME) VALUES ('sunil','rai','26','M','1000000'),('sabnam','rai','25','F','100000'),
{'first_name': 'ujjawal', 'last_name': 'poudel', 'age': '27', 'sex': 'M', 'income': '1000000'}
INSERT INTO EMPLOYEE(FIRST_NAME, LAST_NAME, AGE, SEX, INCOME) VALUES ('sunil','rai','26','M','1000000'),('sabnam','rai','25','F','100000'),('ujjawal','poudel','27','M','1000000'),
{'first_name': 'Sarita', 'last_name': 'gurung', 'age': '24', 'sex': 'F', 'income': '100000'}
INSERT INTO EMPLOYEE(FIRST_NAME, LAST_NAME, AGE, SEX, INCOME) VALUES ('sunil','rai','26','M','1000000'),('sabnam','rai','25','F','100000'),('ujjawal','poudel','27','M','1000000'),('Sarita','gurung','24','F','100000'),
INSERT INTO EMPLOYEE(FIRST_NAME, LAST_NAME, AGE, SEX, INCOME) VALUES ('sunil','rai','26','M','1000000'),('sabnam','rai','25','F','100000'),('ujjawal','poudel','27','M','1000000'),('Sarita','gurung','24','F','100000')

[(4, 4)]

In [10]:
#fetching employee data from employee table
all_employee_data = cursor.execute('SELECT * FROM EMPLOYEE')

In [11]:
# retrieves an employee data from the table
all_employee_data.fetchone()

('sunil', 'rai', 26, 'M', 1000000.0)

In [12]:
all_employee_data.fetchone()

('sabnam', 'rai', 25, 'F', 100000.0)

In [13]:
#sets the limit while fetching data. default is 1.
all_employee_data.fetchmany(5)

[('ujjawal', 'poudel', 27, 'M', 1000000.0),
 ('Sarita', 'gurung', 24, 'F', 100000.0)]

In [14]:
# retrieves all the employee data from the table
all_employee_data.fetchall()

[]

In [15]:
#fetching female employee
female_employee_data = cursor.execute("SELECT * FROM EMPLOYEE WHERE SEX = 'F'")

# retrieves all the female employee data from the table
female_employee_data.fetchall()

[('sabnam', 'rai', 25, 'F', 100000.0), ('Sarita', 'gurung', 24, 'F', 100000.0)]

In [16]:
# updates age by 1 more year in the current age of all male employee.
male_employee_data = cursor.execute("UPDATE EMPLOYEE SET AGE = AGE + 1 WHERE SEX = 'M'")

# retrieves all the male employee data from the table
male_employee_data = cursor.execute("SELECT * FROM EMPLOYEE WHERE SEX = 'M'")
male_employee_data.fetchall()

[('sunil', 'rai', 27, 'M', 1000000.0),
 ('ujjawal', 'poudel', 28, 'M', 1000000.0)]

In [17]:
# delete employee whose age is greater than 115.
cursor.execute("DELETE FROM EMPLOYEE WHERE AGE > 115")


# retrieves all the male employee data from the table
employee_data = cursor.execute("SELECT * FROM EMPLOYEE")
employee_data.fetchall()

[('sunil', 'rai', 27, 'M', 1000000.0),
 ('sabnam', 'rai', 25, 'F', 100000.0),
 ('ujjawal', 'poudel', 28, 'M', 1000000.0),
 ('Sarita', 'gurung', 24, 'F', 100000.0)]

In [18]:
# drop age column
cursor.execute("ALTER TABLE EMPLOYEE DROP COLUMN AGE")


# retrieves all the male employee data from the table
employee_data = cursor.execute("SELECT * FROM EMPLOYEE")
employee_data.fetchall()

[('sunil', 'rai', 'M', 1000000.0),
 ('sabnam', 'rai', 'F', 100000.0),
 ('ujjawal', 'poudel', 'M', 1000000.0),
 ('Sarita', 'gurung', 'F', 100000.0)]

In [19]:
# fetching the data from sql table into dataframe.
import pandas as pd
df = pd.read_sql('SELECT DISTINCT FIRST_NAME, LAST_NAME, SEX, INCOME FROM EMPLOYEE', conn)

In [20]:
df

  FIRST_NAME LAST_NAME SEX     INCOME
0      sunil       rai   M  1000000.0
1     sabnam       rai   F   100000.0
2    ujjawal    poudel   M  1000000.0
3     Sarita    gurung   F   100000.0

In [22]:
# renaming table name to new name.
sql = 'ALTER TABLE EMPLOYEE RENAME TO EMPLOYEES'
cursor.execute(sql)

In [23]:
# selecting all data from employees.
employee_data = cursor.execute("SELECT * FROM EMPLOYEES")
employee_data.fetchall()

[('sunil', 'rai', 'M', 1000000.0),
 ('sabnam', 'rai', 'F', 100000.0),
 ('ujjawal', 'poudel', 'M', 1000000.0),
 ('Sarita', 'gurung', 'F', 100000.0)]

In [24]:
# deleting male employees.
cursor.execute("DELETE FROM EMPLOYEES WHERE SEX = 'M'")

In [25]:
# selecting all data from employees.
employee_data = cursor.execute("SELECT * FROM EMPLOYEES")
employee_data.fetchall()

[('sabnam', 'rai', 'F', 100000.0), ('Sarita', 'gurung', 'F', 100000.0)]

In [26]:
# selecting all table names from schema.
table_data = cursor.execute("SELECT name FROM sqlite_schema WHERE type='table' ORDER BY name")
table_data.fetchall()

[('EMPLOYEES',)]

In [31]:
# Insert employees data sent in an array into the employees table
def insert_employees(employees):
    print(employees)
    sql = "INSERT INTO EMPLOYEES(FIRST_NAME, LAST_NAME, SEX, INCOME) VALUES "
    for employee in employees:
        print(employee)
        sql = sql + "('" + employee["first_name"] + "','" + employee["last_name"] + "','" + employee["sex"] + "','" + employee["income"] + "'),"
        print(sql)
    sql = sql[:-1]
    print(sql)
    result = cursor.execute(sql)

# calling insert employee method to insert employees
data = insert_employees([{"first_name":"sunil", "last_name":"rai", "sex": "M", "income": "1000000"}, {"first_name":"ujjawal", "last_name":"poudel", "sex": "M", "income": "1000000"}])

# calling insert employee method to insert employees
data = insert_employees([{"first_name":"ram", "last_name":"rai", "sex": "M", "income": "100000"}])

[{'first_name': 'sunil', 'last_name': 'rai', 'sex': 'M', 'income': '1000000'}, {'first_name': 'ujjawal', 'last_name': 'poudel', 'sex': 'M', 'income': '1000000'}]
{'first_name': 'sunil', 'last_name': 'rai', 'sex': 'M', 'income': '1000000'}
INSERT INTO EMPLOYEES(FIRST_NAME, LAST_NAME, SEX, INCOME) VALUES ('sunil','rai','M','1000000'),
{'first_name': 'ujjawal', 'last_name': 'poudel', 'sex': 'M', 'income': '1000000'}
INSERT INTO EMPLOYEES(FIRST_NAME, LAST_NAME, SEX, INCOME) VALUES ('sunil','rai','M','1000000'),('ujjawal','poudel','M','1000000'),
INSERT INTO EMPLOYEES(FIRST_NAME, LAST_NAME, SEX, INCOME) VALUES ('sunil','rai','M','1000000'),('ujjawal','poudel','M','1000000')

[(2, 10)]

In [34]:
# selecting all employee whoose firstname contains r.
employee_data = cursor.execute("SELECT * FROM EMPLOYEES WHERE FIRST_NAME LIKE '%R%'")
employee_data.fetchall()

[('Sarita', 'gurung', 'F', 100000.0), ('ram', 'rai', 'M', 100000.0)]

In [35]:
# dropping table employee.
cursor.execute("DROP TABLE EMPLOYEES")

In [36]:
# selecting all table names from schema.
table_data = cursor.execute("SELECT name FROM sqlite_schema WHERE type='table' ORDER BY name")
table_data.fetchall()

[]

In [196]:
# importing pymongo
import pymongo

In [197]:
# importing MongoClient
from pymongo import MongoClient

In [198]:
# initializing MongoClient()
client = MongoClient()

In [199]:
# creating test database
db = client.test

In [200]:
#creating employee collection.
employee = db.employee

In [201]:
employee

Collection(Database(MongoClient(host=['localhost:27017'], document_class=dict, tz_aware=False, connect=True), 'test'), 'employee')

In [202]:
# inserting employee details into employee collection.
employee_details = {
    'Name' : 'Sunil Rai',
    'Address' : 'Scarborough',
    'Age' : '11'
}
result = employee.insert_one(employee_details)
print(result.inserted_id)

64769642d2772f2cc7b32233

In [203]:
 #db.employee.drop()

In [204]:
# creating list of employees
mylist = [{"_id":1,"name":"John","address":"Highway 37"},
          {"_id":2,"name":"Peter","address":"Lowstreet 27"},
          {"_id":3,"name":"Amy","address":"Close st 652"},
          {"_id":4,"name":"Hannah","address":"Mountain 21"},
          {"_id":5,"name":"Michael","address":"Valley 345"},
          {"_id":6,"name": "Vicky", "address": "Yellow Garden 124"},
          {"_id":7,"name": "Nicky", "address": "Yellow Garden 23"},
          {"_id":8,"name": "Nancy", "address": "Younge Ave. 123"},
          {"_id":9,"name": "Viola", "address": "Sideway Ave"},
         {"_id":10,"name":"Johny","address":"Highway 37"},
         {"_id":11,"name":"Johna","address":"Highway 37"},
         {"_id":12,"name":"Johne","address":"Highway 37"}]

In [205]:
# inserting employees into the collection.
result = employee.insert_many(mylist)

In [206]:
# printing all the database names.
print(client.list_database_names())

['admin', 'config', 'local', 'test']

In [207]:
# checking if test db is in the list
dblist = client.list_database_names()
if "test" in dblist:
    print("The '{}' exists".format('test'))

The 'test' exists

In [208]:
# printing collection names
print(db.list_collection_names())

['employee']

In [209]:
collist = db.list_collection_names()
if "employee" in collist:
    print("The employee collection exists.")

The employee collection exists.

In [210]:
# looping through all the employees and printing them.
for emp in employee.find():
    print(emp)

{'_id': ObjectId('64769642d2772f2cc7b32233'), 'Name': 'Sunil Rai', 'Address': 'Scarborough', 'Age': '11'}
{'_id': 1, 'name': 'John', 'address': 'Highway 37'}
{'_id': 2, 'name': 'Peter', 'address': 'Lowstreet 27'}
{'_id': 3, 'name': 'Amy', 'address': 'Close st 652'}
{'_id': 4, 'name': 'Hannah', 'address': 'Mountain 21'}
{'_id': 5, 'name': 'Michael', 'address': 'Valley 345'}
{'_id': 6, 'name': 'Vicky', 'address': 'Yellow Garden 124'}
{'_id': 7, 'name': 'Nicky', 'address': 'Yellow Garden 23'}
{'_id': 8, 'name': 'Nancy', 'address': 'Younge Ave. 123'}
{'_id': 9, 'name': 'Viola', 'address': 'Sideway Ave'}
{'_id': 10, 'name': 'Johny', 'address': 'Highway 37'}
{'_id': 11, 'name': 'Johna', 'address': 'Highway 37'}
{'_id': 12, 'name': 'Johne', 'address': 'Highway 37'}

In [211]:
# fetching first five record.
myresult = employee.find().limit(5)

for emp in myresult:
    print(emp)

{'_id': ObjectId('64769642d2772f2cc7b32233'), 'Name': 'Sunil Rai', 'Address': 'Scarborough', 'Age': '11'}
{'_id': 1, 'name': 'John', 'address': 'Highway 37'}
{'_id': 2, 'name': 'Peter', 'address': 'Lowstreet 27'}
{'_id': 3, 'name': 'Amy', 'address': 'Close st 652'}
{'_id': 4, 'name': 'Hannah', 'address': 'Mountain 21'}

In [212]:
# fetching first five record.
myresult = employee.find()[0:5]
for emp in myresult:
    print(emp)

{'_id': ObjectId('64769642d2772f2cc7b32233'), 'Name': 'Sunil Rai', 'Address': 'Scarborough', 'Age': '11'}
{'_id': 1, 'name': 'John', 'address': 'Highway 37'}
{'_id': 2, 'name': 'Peter', 'address': 'Lowstreet 27'}
{'_id': 3, 'name': 'Amy', 'address': 'Close st 652'}
{'_id': 4, 'name': 'Hannah', 'address': 'Mountain 21'}

In [213]:
# fetching only the name and address of the employee
for emp in employee.find({}, {"_id": 0, "name": 1, "Name": 1, "Address": 1, "address": 1}):
    print(emp)

{'Name': 'Sunil Rai', 'Address': 'Scarborough'}
{'name': 'John', 'address': 'Highway 37'}
{'name': 'Peter', 'address': 'Lowstreet 27'}
{'name': 'Amy', 'address': 'Close st 652'}
{'name': 'Hannah', 'address': 'Mountain 21'}
{'name': 'Michael', 'address': 'Valley 345'}
{'name': 'Vicky', 'address': 'Yellow Garden 124'}
{'name': 'Nicky', 'address': 'Yellow Garden 23'}
{'name': 'Nancy', 'address': 'Younge Ave. 123'}
{'name': 'Viola', 'address': 'Sideway Ave'}
{'name': 'Johny', 'address': 'Highway 37'}
{'name': 'Johna', 'address': 'Highway 37'}
{'name': 'Johne', 'address': 'Highway 37'}

In [215]:
# mongodb query to fetch all records that contains Highway 37 in address.
myquery = {"address": "Highway 37"}

mydoc = employee.find(myquery)

for x in mydoc:
    print(x)

{'_id': 1, 'name': 'John', 'address': 'Highway 37'}
{'_id': 10, 'name': 'Johny', 'address': 'Highway 37'}
{'_id': 11, 'name': 'Johna', 'address': 'Highway 37'}
{'_id': 12, 'name': 'Johne', 'address': 'Highway 37'}

In [229]:
# mongodb query to fetch 2 last records that contains Highway 37 in address.
myquery = {"address": "Highway 37"}

mydoc = employee.find(myquery).limit(2).sort("_id", -1)

for x in mydoc:
    print(x)

{'_id': 1, 'name': 'John', 'address': 'Highway 37'}
{'_id': 10, 'name': 'Johny', 'address': 'Highway 37'}

In [231]:
# mongodb query to fetch 2 last records that contains Highway 37 in address.
myquery = {"address": "Highway 37"}

mydoc = employee.find(myquery)[0:2].sort("_id", -1)

for x in mydoc:
    print(x)

{'_id': 12, 'name': 'Johne', 'address': 'Highway 37'}
{'_id': 11, 'name': 'Johna', 'address': 'Highway 37'}

In [236]:
# mongodb query to fetch all records that contains V in address.
myquery = {"address": {"$regex": "^V"}}

mydoc = employee.find(myquery)

for x in mydoc:
    print(x)

{'_id': 5, 'name': 'Michael', 'address': 'Valley 345'}

In [240]:
# mongodb query to fetch all records that contains l in address.
myquery = {"address": {"$regex": "l"}}

mydoc = employee.find(myquery).limit(2)

for x in mydoc:
    print(x)

{'_id': 3, 'name': 'Amy', 'address': 'Close st 652'}
{'_id': 5, 'name': 'Michael', 'address': 'Valley 345'}